read_verilog /home/jakob/Desktop/Ignite2024/rand/*.v
synth -top top
show -prefix top -format pdf -notitle top
write_verilog top.v