# run with:
# yosys -s synth_ro.ys 

#
read_verilog ro.v 
read_verilog inv.v

#
synth -top ro

# mapping to mycells.lib
#dfflibmap -liberty mycells.lib
#abc -liberty mycells.lib
clean

show -prefix select -format pdf -notitle ro

# write synthesized design
write_verilog synth.v